# Taps
# Homebrew now requires explicit trust for third-party taps (see fresh.sh).
tap 'laravel/moat'        # moat (security posture auditing)
tap 'steipete/tap'        # codexbar
tap 'teamookla/speedtest' # official Ookla speedtest CLI

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'nushell'
brew 'bat'
brew 'btop' # Modern htop alternative
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'whisper-cpp' # Local audio transcription (Whisper via Metal)
brew 'mozjpeg' # JPEG compression for screenshot optimization
brew 'vips' # Image processing for screenshot optimization
brew 'gemini-cli' # Google Gemini CLI
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-open'
brew 'glab' # GitLab CLI
brew 'grep'
brew 'lazygit' # Terminal UI for git
brew 'fd'    # Fast find replacement, used with fzf
brew 'fzf'   # Fuzzy finder (ctrl-r / ctrl-t / alt-c)
brew 'oha' # HTTP load generator (Rust, faster than hey)
brew 'httpie'
brew 'jq' # JSON processor
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mole' # System cleanup utility
brew 'mkcert' # Local HTTPS certificates
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'prettyping'
brew 'qpdf'
brew 'ripgrep' # Fast grep alternative
brew 'speedtest' # Official Ookla CLI (replaced deprecated speedtest-cli)
brew 'starship' # Shell prompt
brew 'tesseract'
brew 'tree'
brew 'wget'
brew 'yazi' # Terminal file manager
brew 'yt-dlp' # YouTube downloader (replaces youtube-dl)
brew 'zoxide' # Smarter cd command
brew 'zsh-autosuggestions'
brew 'lefthook'   # Git hooks manager
brew 'shellcheck' # Shell script static analysis
brew 'shfmt'      # Shell script formatter (bash/sh; not zsh)
brew 'actionlint' # GitHub Actions workflow linter
brew 'luacheck'   # Lua static analysis (Hammerspoon config)
brew 'gitleaks'   # Secret scanning (pre-commit + CI)
brew 'moat'       # Security posture auditing for GitHub orgs/repos (laravel/moat)

# Development
# PHP is managed by Laravel Herd (see cask 'herd' below), not Homebrew
brew 'biome' # Fast formatter/linter
brew 'bun' # JavaScript runtime
brew 'cloudflared' # Cloudflare tunnel
# Composer is bundled with Herd
brew 'imagemagick'

# Apps
# TODO: Switch to stable `jordanbaird-ice` once 0.11.13 is released
cask 'jordanbaird-ice@beta' # Menu bar manager (beta for macOS Tahoe fixes)
cask '1password'
brew '1password-cli'
cask 'ghostty'
cask 'krisp'
cask 'discord'
cask 'orbstack' # Docker/Linux VMs (replaces Docker Desktop; provides docker CLI)
cask 'dockdoor' # Window preview on Dock hover
cask 'github'
cask 'gitup-app'
cask 'handbrake-app'
cask 'imageoptim'
cask 'google-drive'
cask 'google-chrome'
cask 'gcloud-cli' # Google Cloud CLI (gcloud, gsutil, bq)
cask 'firefox@developer-edition'
cask 'slack'
cask 'sublime-text'
cask 'zed'
cask 'cursor'
# Agent CLIs exec'd by bin/cl, bin/cls, bin/cx, bin/cxs, bin/cr
cask 'claude-code'
cask 'codex'
cask 'codexbar' # Codex menu-bar companion (steipete/tap)
cask 'cursor-cli'
cask 'tableplus'
cask 'cyberduck'
cask 'postman'
cask 'herd' # Manages PHP versions, nginx, dnsmasq for Laravel dev
cask 'calibre'
cask 'grandperspective'
cask 'hammerspoon' # macOS automation via Lua scripts
cask 'exodus'
cask 'mac-mouse-fix'
cask 'namechanger'
cask 'nightowl'
cask 'rectangle'
cask 'spotify'
cask 'stremio'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'the-unarchiver'
cask 'jetbrains-toolbox'
cask 'pocket-casts'
cask 'raycast'
cask 'tinkerwell'
cask 'whatsapp'

# Quicklook
# Unsigned app - requires right-click > Open on first launch to bypass Gatekeeper
cask 'syntax-highlight'
cask 'thumbhost3mf'

# Fonts
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas "Battery Indicator", id: 1206020918
mas "Compare Folders", id: 816042486
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Xcode", id: 497799835
