tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "bash"
brew "coreutils"
brew "git"
brew "git-lfs"
brew "mackup"
brew "mas"
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

brew "dnsmasq", restart_service: true
brew "htop"
brew "libgcrypt"
brew "libusb"
brew "usbmuxd"
brew "libpq"
brew "libusb-compat"
brew "libzip"
brew "prettyping"
brew "qpdf"
brew "pngquant"
brew "tesseract"
brew "unrar"
brew "youtube-dl"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "vagrant-completion"

brew "redis", restart_service: true
brew "postgresql@9.6", restart_service: true
brew "mysql@5.7", restart_service: true
brew "nginx", restart_service: true
brew "node"
brew "yarn"
brew "php"
brew "composer"
brew "imagemagick"

# Apps
cask '1password'
cask 'iterm2'
cask 'kap'
cask 'haptickey'
cask 'krisp'
cask 'docker'
cask 'github'
cask 'gitup'
cask 'handbrake'
cask 'imageoptim'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'firefox-developer-edition'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'cyberduck'
cask 'postman'
cask 'flotato'
cask 'calibre'
cask 'disk-inventory-x'
cask 'exodus'
cask 'namechanger'
cask 'nightowl'
cask 'scroll-reverser'
cask 'spectacle'
cask 'spotify'
cask 'stremio'
cask 'tripmode'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'the-unarchiver'
cask 'jetbrains-toolbox'
cask 'whatsapp'

# Quicklook
cask "provisionql"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-json"
cask "quicklookapk"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "quicklook-csv"
cask "qlvideo"
cask "qlcolorcode"

# Fonts
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas "Battery Indicator", id: 1206020918
mas "Compare Folders", id: 816042486
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Medis", id: 1063631769
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835
