# Taps
tap 'homebrew/cask'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'nushell'
brew 'bat'
brew 'btop' # Modern htop alternative
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-open'
brew 'glab' # GitLab CLI
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'jq' # JSON processor
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mkcert' # Local HTTPS certificates
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'handbrake'
brew 'prettyping'
brew 'qpdf'
brew 'ripgrep' # Fast grep alternative
brew 'speedtest-cli'
brew 'starship' # Shell prompt
brew 'tesseract'
brew 'tree'
brew 'wget'
brew 'wifi-password'
brew 'yt-dlp' # YouTube downloader (replaces youtube-dl)
brew 'zoxide' # Smarter cd command
brew 'zsh-autosuggestions'

# Development
brew 'biome' # Fast formatter/linter
brew 'bun' # JavaScript runtime
brew 'cloudflared' # Cloudflare tunnel
brew 'composer'
brew 'imagemagick'

# Apps
cask '1password'
cask 'warp'
cask 'krisp'
cask 'discord'
cask 'docker'
cask 'github'
cask 'gitup'
cask 'handbrake'
cask 'imageoptim'
cask 'google-drive'
cask 'google-chrome'
cask 'firefox@developer-edition'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'cyberduck'
cask 'postman'
cask 'herd'
cask 'calibre'
cask 'grandperspective'
cask 'exodus'
cask 'mouse-fix'
cask 'namechanger'
cask 'nightowl'
cask 'rectangle'
cask 'spotify'
cask 'stremio'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
cask 'the-unarchiver'
cask 'jetbrains-toolbox'
cask 'pocket-casts'
cask 'raycast'
cask 'tinkerwell'
cask 'whatsapp'

# Quicklook
cask 'quickjson'
cask 'thumbhost3mf'

# Fonts
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas "Battery Indicator", id: 1206020918
mas "Compare Folders", id: 816042486
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Pocket", id: 568494494
mas "Xcode", id: 497799835
