# Shared extensions for VSCode and Cursor
# openai.chatgpt excluded (Cursor marketplace only)
anthropic.claude-code
be5invis.vscode-custom-css
biomejs.biome
bmewburn.vscode-intelephense-client
cha0ran.deletecurrentfile
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
dbaeumer.vscode-eslint
drcika.apc-extension
earshinov.permute-lines
ginfuru.ginfuru-better-solarized-dark-theme
github.github-vscode-theme
laravel.vscode-laravel
marclipovsky.string-manipulation
matthewpi.caddyfile-support
monokai.theme-monokai-pro-vscode
mrmlnc.vscode-duplicate
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode.live-server
mubaidr.minimal-mist
nemesv.copy-file-name
phpactor.vscode-phpactor
pshershov.blueberry-banana
redhat.vscode-xml
redhat.vscode-yaml
statelyai.stately-vscode
tamasfe.even-better-toml
vdhoangson.php-namespace-helper
vsuhanov.rename-current-file
vue.volar
ziyasal.vscode-open-in-github
